{"meta":{"title":"to trav","subtitle":"","description":"","author":"Sarah. L","url":"https://www.totrav.com","root":"/"},"pages":[{"title":"About Me","date":"2023-10-25T22:30:02.325Z","updated":"2023-10-25T22:30:02.325Z","comments":false,"path":"about/index.html","permalink":"https://www.totrav.com/about/index.html","excerpt":"","text":"I saved a life, my own. Am I a hero? I really can’t say, but yes My name is Sarah, just 24 years old, but I’ve already gone on some incredible adventures. The world is my playground, and I can’t get enough of it. I’ve gathered memories that fill my heart and fuel my wanderlust. With my camera, I’m not just capturing images; I’m weaving stories. Every photo I take is a page in the novel of my explorations. My blog isn’t just about travel tips; it’s an invitation to see the world through my eyes, to feel the warmth of the sun on your face in Santorini or hearing the leaves rustling in the Amazon rainforest. Come, join me as we continue to explore, wonder, and celebrating the beauty of our world together. Let’s embark on this incredible journey as we wander, laugh, and create unforgettable stories all around the globe."}],"posts":[{"title":"One Chill Day at College Town: University of Missouri - Columbia","slug":"us-mo-columbia","date":"2017-09-16T07:00:00.000Z","updated":"2023-10-27T06:43:37.319Z","comments":true,"path":"post/us-mo-columbia/","link":"","permalink":"https://www.totrav.com/post/us-mo-columbia/","excerpt":"Discover the heart of Missouri in Columbia, a college town with charm. We'll take you through campus vibes, hidden gems, and more. Unearth the essence of the heartland in just one visit.","text":"Small-town charm: your geta way Ratings Value Cost Length &#11088;&#128959;&#128959; &#11088;&#11088;&#128959; &lt;$25 4 hours Time Stamps: 12:00 PM: Lunch at Downtown 12:30 PM: Mizzou Tour (Optional) Mizzou Rec SPA 2:30 PM: The Big Surr Oak Optional: Stephens Lake Park (0.5 hr) Columbia Mall (1 hr) Jefferson City (2.5 hr) Cost: Mizzou Tour: Free (Optional) Mizzou Rec entry: $12 per person The Big Surr Oak: Free (Optional) Missouri State Museum: Free Total: $0-12 Having spent over two years in Columbia - Missouri during my college days, I found it to be a serene and quintessential college town right in the heart of the United States. Situated right between two major Missouri cities, Kansas City and St. Louis, Columbia is a hidden gem that I recommend to anyone traveling through I-70; Stroll at MizzouThe centerpiece of our visit is the campus tour of the University of Missouri - Columbia (Mizzou). I advise setting aside at least 2 hours to explore the main part of the campus.Some must-see spots, in my opinion, include the iconic six columns (alongside Jesse Hall in the same plaza), the Memorial Union, Ellis Library, the Tiger fountain and the Student Center (with the Rec Center conveniently just across the street).For your ease, I’ve outlined an optimal walking route to cover all these interesting points efficiently as I’ve been tour guiding friends and families multiple times. Exploring Campus BuildingsMany of the campus buildings are open to the public. Don’t miss out on visiting the Engineering Building (which was newly built), Jesse Hall, Ellis Library, Memorial Union, and the Student Center. The campus bookstore is also in the Student Center if you wish to purchase Mizzou souvenirs. Mizzou Rec’s Guest ServicesIf you happen to know someone studying in Mizzou, I highly recommend visiting the Mizzou Rec for a reasonable fee of $12 (including tax). In addition to the gym facilities, they offer a spa for some relaxation. Learn more here: Mizzou Rec Guest Services Downtown DelightsColumbia’s downtown area offers a range of delightful options. I often go to the boba shop: Bubblecup Tea Zone, Thai restaurants (Thai Express and Bangkok Gardens are my top picks), and much more to satisfy any taste buds for lunch or dinner after the campus tour The Big Burr OakColumbia’s hidden gem, in my opinion, is the Big burr oak tree. It’s definitely worth a short 10-mile trip, taking less than 20 minutes to drive. The journey is peaceful and the destination is Instagram-worthy shot of a huge Oak tree with the perfect tree crown. Other StopsStephens Lake Park:If you’re looking for a place to unwind after your tour or road trip, I recommend Stephens Lake Park. Although not vast, it features a charming small lake with walking bridges (often bustling with people fishing). It’s a picnic-friendly spot and even welcomes your furry friends. Columbia Mall:For some generic retail stores beyond the downtown area, a visit to the Columbia Mall is a good choice. Jefferson City:The Capital of Missouri, Jefferson City is about a 50 minutes drive from Columbia towards the south, so it’s not in the same direction between Kansas City and St Louis.There’s a pretty good Sushi place called love sushi, they are in good value (the sexy lady and sexy guy are brought with fire lit). Other than the State Capitol Hall and the Missouri State Museum there’s not much to visit.","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]}],"categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]}