{"meta":{"title":"to trav","subtitle":"","description":"","author":"Sheldon Lee","url":"https://www.totrav.com","root":"/"},"pages":[{"title":"Xingyu Lei","date":"2023-10-25T00:28:40.272Z","updated":"2023-10-25T00:28:40.272Z","comments":false,"path":"about/index.html","permalink":"https://www.totrav.com/about/index.html","excerpt":"","text":":star: Crazy for Technical Art Self-motivated learner, critical thinker and problem solver Senior Technical Artist :video_game: &emsp; PlayStation, SIE [Apr 2023 - Present] Un-announced Project Design and build a UE5 game cinematics pipeline from scratch Optimize and develop Maya and MotionBuilder Animation tools and workflow Cross-department coordination, code review, new-hire training Technical Artist :video_game: &emsp; PlayStation, SIE [Jan 2021 - Apr 2023] The Last of Us: Part I Engine optimization on framerate and memory Develop and maintain a tool ecosystem that closely supports Naughty Dog across multiple departments: including Character Library, Pose Library, Engine Capture tool and more Virtual face tracking, technical scene prep, rigging QC, PC and PS5 devkit setup Computer Graphics Research Assistant :books: &emsp; Purdue University [Sep 2018 - Dec 2020] Developed a state-machine-based procedural animation system in Unity and integration with a machine-learning-based emotion recognition module Created automation tool for character rigging and mocap retargeting Technical Documentation and Research Paper Drafting CFX TD :art: &emsp; Blur Studio [May - July 2020] [Jun - Aug 2019] CFX pipeline development and optimization Tool development: hair QC, Qualoth IO, version comparer, soft modification, camera toolkit and more Delivered over 70 shots of cloth/hair simulation using Maya and 3dsMax Works The Last of Us: Part I 2022 Love Death & Robots 2020 Call of Duty: Modern Warefare 2019"}],"posts":[{"title":"Iceland: Land of Fire and Ice","slug":"iceland-general","date":"2017-09-16T07:00:00.000Z","updated":"2023-10-25T20:24:05.470Z","comments":true,"path":"post/iceland-general/","link":"","permalink":"https://www.totrav.com/post/iceland-general/","excerpt":"","text":"Chasing WaterfallsIceland is a land of breathtaking waterfalls. We started our journey with a visit to the iconic Seljalandsfoss, where you can walk behind the cascading water for a unique view. Next, we marveled at the powerful Skogafoss, and we even took a dip in the rejuvenating waters of the Blue Lagoon. Volcanic Adventures Exploring Reykjavik, Iceland’s vibrant capital, was a delight. We sampled traditional Icelandic dishes at local restaurants, strolled along the colorful streets, and took in the view from the towering Hallgrímskirkja. Glacial Beauty Jokulsarlon Glacier Lagoon was a highlight of our trip. We embarked on a boat tour among the floating icebergs, marveling at their incredible shades of blue and crystal clarity. The Northern Lights The ultimate thrill was witnessing the Northern Lights dance across the Icelandic night sky. We huddled under warm blankets, gazing in awe at the ethereal display. Farewell, Iceland As we bid farewell to Iceland, we couldn’t help but feel a profound connection to this land of fire and ice. The memories of this adventure will forever be etched in our hearts. Iceland, with its natural wonders and otherworldly beauty, is a traveler’s dream come true. It’s a place where every moment is a discovery, and every vista is a postcard. Join us on this journey of a lifetime in the land of fire and ice. Continue reading","categories":[{"name":"iceland","slug":"iceland","permalink":"https://www.totrav.com/categories/iceland/"}],"tags":[{"name":"iceland","slug":"iceland","permalink":"https://www.totrav.com/tags/iceland/"}]},{"title":"Exploring the Hidden Gems of Kyoto, Japan","slug":"jp-kyoto-general","date":"2017-08-13T07:00:00.000Z","updated":"2023-10-25T20:26:00.287Z","comments":true,"path":"post/jp-kyoto-general/","link":"","permalink":"https://www.totrav.com/post/jp-kyoto-general/","excerpt":"","text":"Exploring the Hidden Gems of Kyoto, Japan Nestled amidst the ancient temples and bustling cityscape of Japan lies a city that feels like it’s frozen in time. Kyoto, with its rich cultural heritage and serene landscapes, is a traveler’s paradise waiting to be discovered. The Tranquil Bamboo GroveOur journey begins with the famous Arashiyama Bamboo Grove. As you walk through the towering bamboo shoots that seem to touch the sky, you’ll experience a sense of peace and tranquility like no other. It’s a perfect spot for that Instagram-worthy photo to make your friends back home jealous. Historical Temples and ShrinesKyoto boasts over 1,600 Buddhist temples and 400 Shinto shrines, and it’s impossible to explore them all in one visit. But don’t miss Kinkaku-ji, the Golden Pavilion, adorned with real gold leaf. Ginkaku-ji, the Silver Pavilion, is equally mesmerizing with its meticulously landscaped Zen garden. Mouthwatering CuisineKyoto is famous for its kaiseki cuisine, a traditional multi-course meal that’s as beautiful as it is delicious. Savor the delicate flavors of seasonal ingredients while sitting in a traditional ryokan or a small teahouse. Geisha CultureTake a stroll through the Gion district, where you might catch a glimpse of a geisha gracefully gliding through the narrow streets. It’s like stepping into a different era as you immerse yourself in Kyoto’s rich geisha culture. Cherry Blossom SeasonIf you’re lucky enough to visit during the cherry blossom season, you’ll be treated to a breathtaking display of pink and white blooms. Head to Maruyama Park for a traditional hanami picnic under the cherry blossoms with the locals. Kyoto’s CharmKyoto is a city that embraces its past while welcoming the future with open arms. The old and new coexist harmoniously, making it a destination that leaves a lasting impression. As you explore this city, you’ll discover hidden gems at every corner, making your trip an unforgettable experience. Kyoto, with its serene beauty and timeless traditions, will capture your heart and inspire you to wander deeper into the heart of Japan. So, pack your bags and prepare for an enchanting adventure in this extraordinary city.","categories":[{"name":"japan","slug":"japan","permalink":"https://www.totrav.com/categories/japan/"}],"tags":[{"name":"kyoto","slug":"kyoto","permalink":"https://www.totrav.com/tags/kyoto/"}]},{"title":"My Epic Adventure in Patagonia","slug":"us-patagonia","date":"2015-09-25T07:00:00.000Z","updated":"2023-10-25T20:26:43.440Z","comments":true,"path":"post/us-patagonia/","link":"","permalink":"https://www.totrav.com/post/us-patagonia/","excerpt":"","text":"Patagonia, a vast and untamed wilderness, had always been a dream destination for me. My journey through this pristine land was nothing short of epic. The Wild Heart of Patagonia Our adventure began in Torres del Paine National Park. Towering granite peaks, icy-blue lakes, and windswept plains created a surreal landscape. The trek to the base of the iconic Torres del Paine offered jaw-dropping vistas. Into the Glaciers The Perito Moreno Glacier in Los Glaciares National Park was a true marvel. We watched in awe as massive chunks of ice crashed into the turquoise waters, a once-in-a-lifetime spectacle. Wildlife Encounters Patagonia is also a haven for wildlife. We spotted guanacos grazing in the open fields, condors soaring in the sky, and even the elusive puma on a lucky day. Remote Huts Staying in remote mountain huts like Refugio Frey was an adventure in itself. Surrounded by rugged peaks, we shared stories with fellow trekkers under starlit skies. The End of the World Our journey concluded at the End of the World, in Tierra del Fuego. The dramatic landscapes and crisp Antarctic air left an indelible mark. A Journey of a LifetimePatagonia is a land of boundless beauty and adventure. It’s a place where nature reigns supreme, and every moment is an opportunity for discovery. My journey through Patagonia was a dream come true, filled with epic landscapes, wildlife encounters, and unforgettable experiences. Join me in reliving this epic adventure, and start planning your own Patagonian odyssey!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"}],"tags":[{"name":"patagonia","slug":"patagonia","permalink":"https://www.totrav.com/tags/patagonia/"}]},{"title":"A Journey Through the Enchanting Amalfi Coast, Italy","slug":"it-amalfi","date":"2014-08-13T07:00:00.000Z","updated":"2023-10-25T20:25:07.750Z","comments":true,"path":"post/it-amalfi/","link":"","permalink":"https://www.totrav.com/post/it-amalfi/","excerpt":"","text":"The Amalfi Coast, with its rugged coastline and picturesque villages, is a slice of Italian paradise waiting to be explored. The Coastal SplendorOur journey begins with the stunning views of the Amalfi Coast. The azure waters of the Mediterranean stretch out as far as the eye can see, while the colorful cliffside villages offer a postcard-perfect backdrop. Charming VillagesEach village along the coast has its unique charm. Positano, with its narrow streets and pastel-colored buildings, is a romantic haven. Amalfi, the namesake of the coast, boasts a magnificent cathedral and historical beauty. Italian DelightsIndulge in Italian cuisine at its finest. Savor mouthwatering seafood dishes, homemade pasta, and gelato from local gelaterias. Don’t forget to pair your meal with a glass of limoncello, a regional specialty. Hidden BeachesDiscover hidden beaches and coves tucked away between cliffs. Whether you’re swimming, sunbathing, or exploring sea caves, the Amalfi Coast offers a variety of coastal activities. Coastal TrailsHike along the Sentiero degli Dei, the Path of the Gods, and witness breathtaking panoramic views of the coast. The hiking trails provide a unique perspective of the Amalfi Coast’s natural beauty. Sunset MagicAs the day comes to a close, watch the sun dip below the horizon, casting a warm, golden glow over the coastal landscape. Sunsets on the Amalfi Coast are truly magical. A Journey to RememberThe Amalfi Coast is an enchanting destination that will captivate your senses and leave you with unforgettable memories. It’s a dreamy escape that will make you fall in love with the beauty of Italy all over again. So, pack your bags and embark on a journey through the Amalfi Coast, where coastal splendor, charming villages, and Italian delights await. Discover the Amalfi Coast, one of Italy’s most alluring destinations.","categories":[{"name":"italy","slug":"italy","permalink":"https://www.totrav.com/categories/italy/"}],"tags":[{"name":"amalfi","slug":"amalfi","permalink":"https://www.totrav.com/tags/amalfi/"}]}],"categories":[{"name":"iceland","slug":"iceland","permalink":"https://www.totrav.com/categories/iceland/"},{"name":"japan","slug":"japan","permalink":"https://www.totrav.com/categories/japan/"},{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"italy","slug":"italy","permalink":"https://www.totrav.com/categories/italy/"}],"tags":[{"name":"iceland","slug":"iceland","permalink":"https://www.totrav.com/tags/iceland/"},{"name":"kyoto","slug":"kyoto","permalink":"https://www.totrav.com/tags/kyoto/"},{"name":"patagonia","slug":"patagonia","permalink":"https://www.totrav.com/tags/patagonia/"},{"name":"amalfi","slug":"amalfi","permalink":"https://www.totrav.com/tags/amalfi/"}]}