{"meta":{"title":"to trav","subtitle":"","description":"","author":"Sarah. L","url":"https://www.totrav.com","root":"/"},"pages":[{"title":"About Me","date":"2023-12-15T01:00:11.110Z","updated":"2023-10-27T18:17:15.940Z","comments":false,"path":"about/index.html","permalink":"https://www.totrav.com/about/index.html","excerpt":"","text":"I saved a life, my own. Am I a hero? I really can’t say, but yes My name is Sarah, just 24 years old, and I’ve got some incredible adventures I’d like to share with you. A little more about me: I’ve lived in six different states in the United States and traveled to over 30 states. The world is my playground, and I like to capture all my stories with my cameras. Come, join me as we continue to explore, wonder, and celebrating the beauty of our world together. Let’s embark on this incredible journey as we wander, laugh, and create unforgettable stories all around the globe."}],"posts":[{"title":"","slug":"template/test","date":"2024-01-02T00:47:01.945Z","updated":"2024-01-02T03:31:24.969Z","comments":true,"path":"post/template/test/","link":"","permalink":"https://www.totrav.com/post/template/test/","excerpt":"","text":"this is a three day trip during thanks giving in universal studio florida orlando and island of adventure and outlets island of adventureuniversal studio floridaoutlets","categories":[],"tags":[]},{"title":"[Review] Cedar Point - Top 10 Roller Coaster Ranking in 2024","slug":"review-cedarpoint","date":"2024-01-01T08:00:00.000Z","updated":"2024-01-01T21:01:38.670Z","comments":true,"path":"post/review-cedarpoint/","link":"","permalink":"https://www.totrav.com/post/review-cedarpoint/","excerpt":"Join me on a thrilling adventure to Cedar Point, a roller coaster enthusiast's dream! This blog guides you through the park's top rides like Top Thrill 2 and Maverick and more. Get insider tips on navigating the park and choosing the best rides for an unforgettable day of fun","text":"Roller Coaster Heaven Ratings Best Travel Date Cost Length &#11088;&#11088;&#11088; May - October $90 1 day TLDR tips: Pre-purchase Holiday Bundle prior to opening season for $49 (free parking and meal) Fast pass is highly recommended if you are only visiting one day Single rider option are available for faster wait time General park tips: Get in early when the park opens Eat light for breakfast and lunch Considering going on a Sunday (Weekend) or Wednesday (Week days), also crowd calendar for reference: https://www.isitpacked.com/crowd-calendars/ Cost: Ticket: $49 (pre-purchase holiday bundle at the same price for savings) Parking: $30 (included if purchased Holiday Bundle) Food Drink and Snacks: $15 Lunch at Cedar Point: $15 (included if purchased Holiday Bundle) Dinner at Bay Harbor: $50 Total: $90-$130 IntroductionThis blog is a blend of a travel review and a roller coaster ranking. I love a good thrill and nothing beats the rush of zipping around on a fast roller coaster. I like the big drops and quick turns that get my heart racing. Theme parks like Universal Studios and Disneyland are great, but sometimes their rides are a bit too calm for me. Plus, the long lines can be a bit of a downer. But then, there’s Cedar Point. It’s huge, covering 364 acres, and it’s got more than 16 roller coasters. That’s a lot more than most parks. It’s right next to Lake Erie, so the views from the top of the rides are amazing. It’s the perfect place for someone who loves a bit of adrenaline. I live pretty close, just about two hours away, so I’ve been going there every year for the last three years. I’ve tried almost all the rides, except for the Top Thrill Dragster, which they’re updating to Top Thrill 2 since it closed in 2021. Best RouteCedar Point is pretty big and some of the rides are kind of similar. So, if you don’t have a lot of time (like if you have to drive 4 hours back to Columbus, Ohio), you need to plan your day right. On busy days, you might have to wait 45 to 75 minutes for a ride, so you might only get on 4 or 5 rides. But if you go on a quieter weekday, or if you have a pass that lets you skip the lines, you can go on almost all the rides. The park is laid out in a circle. There are some really cool coasters you’ve got to try. You can go around the park any way you want, but I usually start with the big ones like Top Thrill 2, Millennium Force, and Maverick to avoid the crowds later in the day. If you’re not ready to jump into the big thrills right away, starting with the less intense rides is just as fun. Location A: Front Gate Location B: Raptor Location C: Valrayn Location D: Gate Keeper Location E: Rougarou and Millennium Force Location F: Maverick and Steel Vengeance Location G: Gemini Location H: Magnum XL-200 Location I: Top Thrill 2 World Records and AwardsTop Thrill 2: No. 1 Tallest Steel Roller Coaster No. 1 Longest Steel Roller Coaster Drop No. 2 Fastest Steel Roller Coaster No. 21 Overall Ranking for Steel Roller Coaster Millennium Force: No. 2 Overall Ranking for Steel Roller Coaster No. 5 Longest Steel Roller Coaster No. 6 Tallest Steel Roller Coaster No. 7 Longest Steel Roller Coaster Drop No. 7 Fastest Steel Roller Coaster Steel Vengeance: No. 3 Overall Ranking for Steel Roller Coaster No. 7 Longest Steel Roller Coaster Maverick: No. 13 Overall Ranking for Steel Roller Coaster Magnum XL-200: No. 18 Overall Ranking for Steel Roller Coaster My Top 10 Ranking1. Top Thrill 2 Constructed TBD Height 420 ft (130 m) Drop 400 ft (120 m) Speed 120 mph (190 km/h) Inversions 0 I will always regret not trying this ride back in 2020. Not only was it ranked the tallest and the longest drop roller coaster, but it was also ranked number two for the fastest roller coaster. So statistically, it is a must-visit ride (although it is short in duration). When I finally had the courage to give it a shot in 2022, which was my last visit, it was unfortunately shut down due to an incident. The roller coaster will be rebranded as Top Thrill 2 in the near future. 2. Maverick Constructed 2007 Height 105 ft (32 m) Drop 100 ft (30 m) Length 4,450 ft (1,360 m) Speed 70 mph (110 km/h) Inversions 2 The Maverick holds a special place in my roller coaster ride journey. Although it is not ranked highly in the world of roller coasters, it is by far the smoothest and the most fun ride I’ve had. It is one of the hottest attractions in Cedar Point for a reason. The entire ride’s turns and acceleration are at the perfect tempo, making it the best ride I’ve experienced. 3. Millennium Force Constructed 2000 Height 310 ft (94 m) Drop 300 ft (91 m) Length 6,595 ft (2,010 m) Speed 93 mph (150 km/h) Inversions 0 Millennium Force was ranked the number two best roller coaster in the world in the overall category back in 2019. It’s almost perfect in every aspect. Be prepared to be amazed by its scale and height (close to 100m) and also be prepared to wait since many people will be in line for it. 4. Steel Vengeance Constructed 2018 Height 205 ft (62 m) Drop 200 ft (61 m) Length 5,740 ft (1,750 m) Speed 74 mph (119 km/h) Inversions 4 Steel Vengeance is ranked number three in the overall roller coaster rankings. Being one of its kind, a hybrid coaster constructed with both steel and wood, it’s a new creation and a joyful ride. 5. Gate Keeper Constructed 2013 Height 170 ft (52 m) Drop 164 ft (50 m) Length 4,164 ft (1,269 m) Speed 67 mph (108 km/h) Inversions 6 The Gate Keeper is on the list because it is special. With its name, it’s not hard to figure out that the coaster actually goes through Cedar Point’s front gate. It’s the very first roller coaster that everyone will see, and it’s a lot of fun too. 6. Magnum XL-200 Constructed 1989 Height 205 ft (62 m) Drop 194.7 ft (59.3 m) Length 5,106 ft (1,556 m) Speed 72 mph (116 km/h) Inversions 0 Magnum, in my opinion, is the little brother of Millennium Force. It resembles Millennium Force in almost every aspect of its track, with only more family-friendly stats. 7. Valravn Constructed 2016 Height 223 ft (68 m) Drop 214 ft (65 m) Length 3,415 ft (1,041 m) Speed 75 mph (121 km/h) Inversions 3 Valravn is another thrill coaster featuring one of the tallest, fastest, and longest dives in the US. It was newly constructed in 2016 with amazing speed and the right amount of inversions. 8. Raptor Constructed 1994 Height 137 ft (42 m) Drop 119 ft (36 m) Length 3,790 ft (1,160 m) Speed 57 mph (92 km/h) Inversions 6 Raptor is an inverted roller coaster (it travels below the track). It’s mildly thrilling in all aspects, making it a good starter ride. 9. Gemini Constructed 1978 Height 125 ft (38.1 m) Drop 118 ft (36.0 m) Length 3,935 ft (1,199.4 m) Speed 60 mph (96.6 km/h) Gemini is on the list because it features two tracks with the blue and red trains racing against each other. It’s also a wooden roller coaster and one of the oldest tracks still in operation. It’s a lot of fun to experience the racing aspect and see which team wins; the winning team gets a prize (cheers). 10. Rougarou Constructed 1996 Height 145 ft (44 m) Drop 137 ft (42 m) Length 3,900 ft (1,200 m) Speed 60 mph (97 km/h) Inversions 4 Rougarou, similar to Raptor, is your standard roller coaster that is mildly thrilling in all aspects. It’s pretty good as a starter course and won’t give you a headache or fright with only 4 inversions and a medium 60mph speed. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"ohio","slug":"united-states/ohio","permalink":"https://www.totrav.com/categories/united-states/ohio/"},{"name":"cedar point","slug":"united-states/ohio/cedar-point","permalink":"https://www.totrav.com/categories/united-states/ohio/cedar-point/"}],"tags":[{"name":"review","slug":"review","permalink":"https://www.totrav.com/tags/review/"}]},{"title":"[Review] Fisherman's Landing - I vomited twice so you don't have to","slug":"review-fishermanlanding","date":"2023-10-08T07:00:00.000Z","updated":"2024-01-02T00:42:37.310Z","comments":true,"path":"post/review-fishermanlanding/","link":"","permalink":"https://www.totrav.com/post/review-fishermanlanding/","excerpt":"Join my ocean fishing adventure for beginners! Explore the Fisherman's Landing journey, from excitement to challenges, and discover the catch of the day.","text":"I threw up twice Ratings Best Travel Date Cost Length &#11088;&#128959;&#128959; All year round $120 6-8 hours TLDR tips: Expect to get sea sick (even with motion sickness pill), so don’t eat much before the trip Share fish bag with your partner to save $2 Wear jacket! cold and windy on the sea Time Stamps: 12:00 PM: (Optional) Lunch at Downtown 1:00 PM: Boat departures 2:20 PM: First Fishing Spot 4:00 PM: Second Fishing Spot 5:30 PM: Boat begins to return 6:30 PM: Arrival at dock Cost: Boat Ticket: $70 (Optional) Supplies: Motion Sickness Medicine: $5 Sun Screen: $7 Fish Bag: $2 Fish Raffle: $3 Equipment Rental: $22 Fishing License: $20 (Optional) Fish Cleaning: $1-2 per fish Parking: $5 Total: $110-$130 For those venturing into ocean fishing for the first time, I’m here to share my experience and insights. I boarded the “Dolphin,” hopeful that we might spot dolphins or even whales during our journey since I know there’s some trips by the coast that offers such tou. I was wrong because all I get to see are a lot of seagulls… Sundays offer a special treat where one adult can bring a child on board for free. Hence, this day, the boat was bustling with children. There are also many seasoned fishermen joining us, their fancy equipment and confidence slightly intimidates first-timers like us. Check-In and PreparationsThe check-in process at the office was hassle-free. We got our fishing licenses and rented gear (fishing rods and weights) from the counter, with abundant parking nearby. The boat’s boarding process was quick as well, with the staff assisting us on assigning bags for our “catches”. Tip: it’s cost-effective to share a bag with a partner, as each bag costs $2, something I find interesting is that there’s a $3 raffle for the person who lands the largest fish (waiving the $70 boat ticket). Setting Sail and BaitingShortly after departure, the crew prepared live fish from the onboard tank for fresh bait, alongside other options like squid strips. After an hour into the sea, we received a briefings on how to ocean fish (different than your regular fishing): we were to drop the hook, attached to a heavy anchor, down to the ocean floor, then raise it slightly above the seabed. This is where the fish congregate to bite; We were also advised that the area at the tail of the boat experiences the least turbulence in order to avoid dizziness. Fishing BeginsAfter about 1.5 hours, the boat finally anchored, and everyone was eager to cast their lines. No specific spots were assigned, people could choose any available space. Learning to operate the fishing equipment only took a couple of tries, but the real challenge was sensing the bites with the boat’s constant movement. I caught my first mackerel in under 10 minutes, followed by another. However, we started to feel queasy (even though we had taken motion sickness pills). We were far from the coast, with moderate waves, and the temperature dropped considerably, shifting from sunny to windy. The cold wind, turbulence, and motion sickness made it hard to keep myself continuing fishing. I took a break and headed to the restroom to throw up. Feeling better afterward, I resumed fishing and caught my first sculpin, a peculiar-looking, venomous fish (they had to remove its spines before unhooking it). Unfortunately, I fell ill once more and vomited the second time. Time passed quickly, but due to the time I spent resting, I estimated about 1.5 hours of actual fishing. The boat repositioned once mid-way. Those prone to motion sickness like myself have considerably less fishing time. ReturnThe boat started heading back around 5:30 PM, and the temperature continued to drop with the wind becoming harsh and the sun setting down. I was weak, feeling, due to the effects of throwing up twice and missing my regular dinner. The journey back left me cold and miserable. In the end, the crew helped clean and fillet our catch: even with all these comforts, we still caught 5 mackerels and 2 sculpins. We cooked them, but they didn’t taste different from store-bought fish. Overall, the experience was mid, and quite expensive at $300 for just a couple of fish. I believe we would have enjoyed it more without the motion sickness, I never thought I could get seasick before going into it. A few other first-timers also struggled with seasickness, so it’s something to keep in mind to lower your expectation. Overall, it was a unique experience, but I gave it a one-star rating due to the physical discomfort I endured. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"california","slug":"united-states/california","permalink":"https://www.totrav.com/categories/united-states/california/"},{"name":"san diego","slug":"united-states/california/san-diego","permalink":"https://www.totrav.com/categories/united-states/california/san-diego/"}],"tags":[{"name":"review","slug":"review","permalink":"https://www.totrav.com/tags/review/"}]},{"title":"Spend one day at Cleveland downtown and Beaver Marsh","slug":"us-oh-cleveland","date":"2022-07-03T07:00:00.000Z","updated":"2024-01-02T00:12:15.962Z","comments":true,"path":"post/us-oh-cleveland/","link":"","permalink":"https://www.totrav.com/post/us-oh-cleveland/","excerpt":"Embark on a journey through Cleveland's vibrant downtown, iconic landmarks, and a profound encounter with nature at Cuyahoga Valley National Park's enchanting Beaver Marsh. Explore the essence of Cleveland, from historic memorials to the serene beauty of the park's marshlands","text":"A Dream Come True Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; April - October &lt;$25 4-8 hours TLDR tips: Visit the Beaver Marsh at Cuyahoga Valley National Park if you are running short in time Be patient and focus, and you may be able to see a beaver Downtown walkthrough Cleveland is clean and refreshing Don’t recommend the Greater Cleveland Aquarium Time Stamps: 10:00 AM: Park downtown and visit The Arcade 10:30 AM: Walk through Cleveland downtown 11:00 AM: Quick tour at “Rock Hall” and USS COD Submarine 11:30 AM: Return to downtown parking spot 12:00 PM: Lunch at West Side Market (optional): Greater Cleveland Aquarium (1 hour) 1:00 PM: Drive to Cuyahoga Valley National Park (1 hour) 2:00 PM: Visit the Beaver Marsh at Ira trail (1.5 hour) 3:30 PM: End trip Cost: Parking: Free (for 2 hours) (Optional) Rock Hall: $35 per person (Optional) USS COD Submarine: $14 per person (Optional) Greater Cleveland Aquarium: $20 per person Cuyahoga Valley National Park: Free Total: $0-70 The ArcadeFirst, we checked out The Arcade in downtown Cleveland. Super easy to park on the streets, especially on weekends when it’s free for the first two hours. Downtown’s actually pretty neat – clean and felt safe. Walking into The Arcade, you’re hit with this old-school vibe. It’s a mix of a hotel and a mini-mall, but not too crowded. Just a handful of tourists snapping pics, some staff getting ready for an event, and a few folks chilling with coffee. Couldn’t go upstairs where the hotel rooms are and most shops were shut, but the main level was open for a little exploring. Great spot for some cool photos to post on Instagram. Downtown WalkWith our 2-hour free parking, we decided to stroll around downtown Cleveland. Picked a route that’d take us about half an hour, passing by a bunch of cool places and ending up at the pier by Lake Erie. Perfect way to see the city without worrying about the car. The Mall Walking through downtown really gives you the feel of the city – like how well they keep up the roads and parks. Cleveland’s got some nice spots like the Soldiers’ and Sailors’ Memorial, a cool fountain, and this meadow at The Mall. Plus, you’re not too far from the pier. Rock and Roll Hall of Fame: “Rock Hall” If you’re into music, the Rock and Roll Hall of Fame’s a must. It’s $35, but you get the whole history of rock music. They even have free live shows in the plaza if you just wanna hang around. USS COD Submarine Memorial Right by the Rock Hall, there’s this old submarine, the USS COD. It’s like a museum now. They ask $14 for adults and $8 for kids. Didn’t go in though – seemed a bit pricey for what it was. Other AttractionsWest Side Market Feeling hungry or eager to go to see some down to the ground local shops? West Side Market is where you can grab a quick bite and check out some local merchs. Greater Cleveland Aquarium Went to the Greater Cleveland Aquarium on March 13, 2019. It’s near Lake Erie, so I was pretty hyped. But, honestly, it’s kinda small and not super exciting unless you have kids. At $20, might skip it if you’re just adults. Cuyahoga Valley National Park: Beaver MarshDon’t forget to chill at the Cuyahoga Valley National Park. No entry fee, which is great. The Ira Trail’s an easy walk and takes you right to Beaver Marsh. Saw a beaver zipping underwater and even some turtles! Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"ohio","slug":"united-states/ohio","permalink":"https://www.totrav.com/categories/united-states/ohio/"},{"name":"cleveland","slug":"united-states/ohio/cleveland","permalink":"https://www.totrav.com/categories/united-states/ohio/cleveland/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]},{"title":"Spend July 4th at Washington D.C and Baltimore","slug":"us-dc-washington+baltimore","date":"2021-07-03T07:00:00.000Z","updated":"2024-01-01T18:24:22.220Z","comments":true,"path":"post/us-dc-washington+baltimore/","link":"","permalink":"https://www.totrav.com/post/us-dc-washington+baltimore/","excerpt":"Explore Washington, D.C. and its treasures during the National Day holiday. Discover the best museums and landmarks, watch dazzling fireworks, and savor the culinary delights of Chinatown. Extend your adventure to Baltimore and the Leesburg Premium Outlets for a well-rounded trip. Join us for travel inspiration and tips!","text":"National Day at National Capital Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; July 3rd-5th $300 2 days (1 night) TLDR tips: Plan ahead for July 4th partial museum closure Arrive 30 minutes in advance for firework and expect heavy traffic Chinatown is a good place to stay, lots of food and hotel options, walking distance to museums Visit Baltimore at daytime, or outlets if you need time to spare Time Stamps: Feel free to switch the order of day-1 and day-2: Day 1: (July 3rd) 10:00 AM: Washington D.C National Park (8-10 hr) Lunch are available inside Museums 7:00 PM: Dinner at Chinatown Day 2: (July 4th) 10:00 AM: Leave Washington D.C to Baltimore (1 hr) 11:00 AM: Baltimore Dockside (1 hr) 12:00 PM: Lunch at Thames Street Oyster House (1 hr) 1:00 PM: Leave Baltimore to Leesburg Premium Outlets (1 hr) 2:00 PM: Shop at Leesburg Premium Outlets (3 hr) 5:00 PM: Leave Leesburg Premium Outlets to Washington D.C (2 hr) 7:00 PM: Dinner and get prepared for Firework (2 hr) 9:00 PM: Firework show (0.5 hr) Cost: Lunch in Museum: $20 per person Dinner at Chinatown: $25 per person Lunch at Thames Stree Oyster House: $30 per person Dinner at D.C: $25 per person Parking: $40 per vehicle Hotel one night: $150 Museum Entry: Free Total: $300 Although I’ve been to Washington D.C once when I was young, it has been quite a while, thus I’m revisiting it again to freshen my memory and to experience it as adult. It also happens to be during the time of the National Day holiday, so I thought it would be perfect for a capital Washington D.C trip. National ParkImportant: Expect partial closure on July 4th due to setting up firework, that includes everything west of 17th st, the Lincoln Memorial and Reflecting Pool; The Washington Monument, being the center-piece of the firework is also locked down. Visiting on July 3rd or 5th shouldn’t be a problem. You can easily spend half a day in a single museum, especially if you’re with kids. But I find for the larger and more famous museums, two hours is generally sufficient if you just want a brief experience, and for other smaller sites, half to one hour. Here’s an example route from my experience: National Museum of Natural History (2 hr) National Gallery of Art (1 hr) National Air and Space Museum (1 hr) United States Botanic Garden (0.5 hr) Smithsonian Castle (0.5 hr) The White House (0.5 hr) The Ellipse Washington Monument (1 hr) World War II Memorial and Reflecting Pool (1 hr) Lincoln Memorial (1 hr) Korean War Veterans Memorial During my visit on July 4th, I could only catch a glimpse of Capitol Hill, the Smithsonian Castle, and the White House, primarily due to Covid restrictions that had temporarily closed down all the museums. It was a bit disappointing to say the least. As I mentioned, you could easily spend more time at each museum, and there are many other attractions within the National Park and commercial museum of different theme the surrounding streets. FireworkDon’t worry too much on spaces for watching the fireworks, there are plenty of spots to sit; just make sure to arrive 30 minutes in advance and on foot. Expect large crowds and traffic congestion (driving and parking could be a problem). The fireworks display lasts around 10-15 minutes, it can be a bit underwhelming for some, especially it doesn’t have music accompaniment like fireworks at Disneyland. ChinatownChinatown is within a 15-minute walk from the National Park and is accessible via D.C.’s metro system. It’s not only a great dining district but also home to several nearby hotels. You will find dinning option here after the firework show close to 10 pm till mid-night. I stayed at the Fairfield Inn, just across the street from Chinatown. However, I wouldn’t recommend this hotel as it feels a bit dated. BaltimoreBaltimore, home to the famous Johns Hopkins University, is just an hour’s drive away from Washington, D.C. I’d recommend a short visit during the National Park’s closure. Baltimore is generally clean and safe during the day, and I particularly enjoyed the dockside area. There are also plenty of parking garages available. Thames Street Oyster HouseAfter strolling around downtown and the dock region, we had an amazing dining experience at the Thames Street Oyster House, where we indulged in a different selections of delicious raw oyster. Leesburg Premium OutletsAnother option to fill the rest of your day is a visit to the Leesburg Premium Outlets, which is about an hour away from D.C as well. Here, you’ll find all the popular brands you’d expect from an outlet store, plus some luxury brand like Armani and Burberry. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"dc","slug":"united-states/dc","permalink":"https://www.totrav.com/categories/united-states/dc/"}],"tags":[{"name":"weekend trip ideas","slug":"weekend-trip-ideas","permalink":"https://www.totrav.com/tags/weekend-trip-ideas/"}]},{"title":"Ohio's Hidden Attraction: Spend A Family Day at Put-in-Bay Island","slug":"us-oh-putinbay","date":"2021-05-30T07:00:00.000Z","updated":"2024-01-01T18:13:38.127Z","comments":true,"path":"post/us-oh-putinbay/","link":"","permalink":"https://www.totrav.com/post/us-oh-putinbay/","excerpt":"An island retreat in Lake Erie, just a short ferry ride away from Ohio and Michigan. Experience nature's beauty, explore the Perry's Cave Family Fun Center, visit a winery, and tour crystal caves. Golf cart adventures, stunning vistas.","text":"A Family Fun Place Ratings Best Travel Date Cost Length &#11088;&#128959;&#128959; May-October $100 6-8 hours TLDR tips: Golf carts are the superior choice compared to bringing your own vehicle or renting a bike No need to reserve golf carts, plenty of rental in downtown Buy combo tickets at Perry’s Fun Center to save money Don’t recommend the butterfly house Time Stamps: 9:00 AM: Departure (2 hr) 11:00 AM: Arrival at Miller Ferry 11:30 AM: Boarded Ferry (0.5 hr) 12:00 PM: Bus ride to Put-in-bay harbor (downtown) Lunch at Put-in-bay harbor 1:00 PM: Golf cart rental 1:30 PM: Perry’s Victory &amp; International Peach Memorial (1 hr) 2:30 PM: Scheeff East Point view (0.5 hr) 3:00 PM: Perry’s Cave Family Fun Center (2 hr) Winery Tour Crystal Cave Butterfly House 5:00 PM: Return Ferry Cost: Ferry round-trip: $18 (per person), $40 (per vehicle) Bus on the island: $5 (per person) Golf cart rental: $50-$70 Lunch: $25 (per person) Perry’s Cave Family Fun Center (Pick 3): $30 Winery ticket Crystal Cave ticket Butterfly House ticket Total: $100 Two hours (100 miles) away from Columbus, Cleveland Ohio, and Detroit Michigan lies a peaceful island, Put-in-Bay, situated on Lake Erie (one of the Great Lakes). It’s an ideal destination for a family day trip, offering a hassle-free and perfect nature getaway with serene landscapes of trees and water. Here’s a link to their official website. for event information, locations, and transportation details. Miller Ferry at Catawba IslandThe Catawba Island Ferry is how you would reach Put-in-Bay island from the other side. It provides many parking spots just outside the boarding and ticketing area. You can choose to board the ferry on foot or drive your own car (expect much longer wait times for vehicles since there aren’t many spots). The wait isn’t bad if you’re on foot, even if you see there’s a long line, don’t be discouraged as the ferry can fit a large number of passengers (although many will be standing). After a brief half-hour wait, we boarded the ferry, with passengers moving to the second floor. Watching them load vehicles was quite interesting, and we enjoyed the 20-minute breeze on the lake as the ferry sailed. Put-in-bayUpon arriving at the island, you have a convenient bus taking you to downtown Put-in-Bay. Alternatively, you can rent a golf cart. Unfortunately, there was limited availability for golf cart rentals near the dock (there are plenty of golf carts available in the downtown area). We had lunch at “The Boardwalk”, located right by the lake near downtown. The food was decent, although a bit pricier than we would have expected from a little island. After lunch, we took a leisurely walk along Bayview Avenue exploring local shops and sweets. Golf Cart RentalWe initially thought all golf carts were rented out because people on the bus were checking for availability and finding none. However, simply walking around, we discovered more rental options. We ended up renting one for $50 for 4 hours (also no driver’s license needed). Driving the golf cart was straightforward, but we soon realized it was missing a windshield. This made our drive a bit cooler, but it wasn’t a big deal. There’s very little regular vehicle traffic on the island, making it easy to navigate. Golf carts are quite versatile and can be parked almost anywhere. Compared to bringing your own vehicle, or even renting a bike, golf carts are the superior choice. Perry’s Victory and International Peace MemorialOur first stop was Perry’s Victory and International Peace Memorial, a monument where you can spend around 30 minutes relaxing and enjoying the lakeside views. Driving the golf cart to the northeastern corner, we reached Scheeff East Point View. As mentioned earlier, the island has minimal traffic, allowing you to park and go wherever you like. Perry’s Cave Family Fun CenterThe main attraction on the Put-in-bay is Perry’s Cave Family Fun Center, it is a hub for different smaller attractions such as mini-golf, winery tour, cave tour, butterfly tour, and gemstone mining (and many more). During our limited time, we only visited a few, but it’s an excellent place to spend a full day. Just be sure not to miss the last ferry back to the mainland, which departs at 5:00 PM. Tickets range from $9 to $12 each for different attractions depending on whether you purchased separately or as combo tickets (e.g., choose any 3 out of 5 attractions). Winery Tour Put-in-Bay hosts a winery that distributes its own wines across the states. Enjoy a tour of the winery, covering the entire winemaking process from raw grapes to a packaged bottle in just 30 minutes. You also get to learn different kinds of wines and have a final tasting after the tour. It was a pretty refreshing for me. Crystal Cave The crystal cave (Perry’s Cave) is the main attraction where you get to go 50 feet underground to explore the cave that is hallowed out from a single crystal geode, an impressive sight. I estimate it is around 800 square feet in sizes. The tour is self-guided, not a lot to see since it’s just one cave, but fair for its price. Butterfly House I don’t recommend the butterfly house, for $10 price you only get to spend at most 10 minutes as there are nothing really to see in this small and humid room (no more than 1000 square feet). The variety of butterflies is limited, and it’s not very captivating. Unless you have children who are particularly fond of butterflies, spending time just in the gift shop area should suffice. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"ohio","slug":"united-states/ohio","permalink":"https://www.totrav.com/categories/united-states/ohio/"},{"name":"put-in-bay","slug":"united-states/ohio/put-in-bay","permalink":"https://www.totrav.com/categories/united-states/ohio/put-in-bay/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]},{"title":"Chasing Rainbows: A 3-Day Journey Through Niagara Falls","slug":"us-ny-niagara","date":"2020-10-08T07:00:00.000Z","updated":"2023-11-26T17:35:47.543Z","comments":true,"path":"post/us-ny-niagara/","link":"","permalink":"https://www.totrav.com/post/us-ny-niagara/","excerpt":"Our 3-day Niagara Falls journey was a mesmerizing escape. From the Horseshoe and American Falls to the Maid of The Mist boat tour, each angle captivated. The roaring cascade, rainbow-draped mist, and thrilling helicopter ride revealed nature's grandeur","text":"A Dream Come True Ratings Best Travel Date Cost Length &#11088;&#11088;&#11088; April - October $400 2-3 days TLDR tips: Beware of the season closure of the Niagara Falls related attraction, usually May to October is pretty safe Select certain dates to see firework, light show on the other hand happens every night Pay helicopter tour using cash saves $20 per person Time Stamps: Day 1 9:30 AM: Departure from Columbus, Ohio 12:30 PM: Arrive at Erie, Pennsylvania 1:00 PM: Casual Lunch 1:30 PM: Presque Isle and Channel Lighthouse tour 4:30 PM: Arrive at Niagara Falls Check in at Hyatt Place Niagara Falls 7:00 PM: Dinner at Rainforest Cafe Day 2 9:00 AM: Niagara State Park 10:00 AM: Boarding at Maid of the Mist (1 hour) 12:30 PM: Lunch at xx Restraunt 3:00 PM: Rainbow Helicopter ride 4:00 PM: Goat Island Fashion Outlets of Niagara Falls USA 5:30 PM: Thai food at the Mandalay Restraunt &amp; Bar 7:30 PM: Lightshow Day 3 9:00 AM: Cave of the Winds 10:30 AM: Drive back home Cost: Toll: $10 per round-trip Hotel at Hyatt Place Niagara Falls: $50 per person (per day) Parking: $10 per day Tickets: Maid of the Mist: $29 (Optional) Helicopter Ride: $120 (Optional) Cave of the Winds: $14 State Park entrance: Free Food: $90 Total: $370-$400 I visited Niagara Falls when I was only about seven years old with my parents, but I completely forgot about it. Now that I am a grown-up, I can confidently say that the view of Niagara will certainly stick in my memory for the rest of my life because it was just so magnificent. The reason why we chose Niagara Falls is that we only planned to spend 3 days and 2 nights out. Niagara Falls is a single attraction with a 10-12 hour round trip, which is perfect. Also, the weather is starting to get cold, and we won’t have the option to visit anything in the north during the winter. Day 1We left Columbus, Ohio, freshly awake and energized early in the morning. Our plan was to have a short lunch halfway and then dinner at our destination: Niagara Falls. City ErieThe drive up north to Lake Erie was very familiar, as it is pretty much the same route to Cleveland. After passing Cleveland, just about half an hour away, we arrived at City Erie, located past the state border in Pennsylvania. After a quick bite, we stopped by at Presque Isle nearby, a clean and quiet island neighborhood. It looks very out of place to see many small houses floating on the lake. I am fascinated by this kind of living style. It must be super peaceful to roll a small kayak and dock right at your house’s front door. I also wonder how utilities work in a facility like this? The Channel Lighthouse is not far away, and many people living nearby take afternoon walks alongside the beautiful shoreline. Seagulls are basking in the warm sun at the foot of the lighthouse and then got startled as we walked in. All of them flew at the same time, which was quite a view, but I didn’t capture it. City NiagaraWe didn’t rest at all in the afternoon and continued our remaining 3-hour drive. We could already see the wide and strong river force of the Niagara River as we passed Buffalo, New York. We then could hear the Niagara Falls roaring and the water mist rising in the air just 10 minutes away from our destination. We also saw many rainbows. It was exhilarating, and all our tiredness from the long drive went away instantly. The Hyatt Place Niagara Falls is our hotel choice. The rooms are quite cheap during Covid season, and parking is located just across the street, only $10 per day with the hotel price. The Niagara Falls State Park and the Rainbow Bridge Toll Gate that connects Canada are all within the room view, about a 5-minute walking distance. A lot of the shops and restaurants are shut down during Covid, including the One Niagara Welcome Center, which houses many shops and food for a relatively cheaper price and within a very convenient distance. We had our “pre-dinner” walk around the tourist town. Not many visitors due to Covid and being on a weekday, which is both good and bad. I know there’s gonna be less wait for all the attractions and photo-taking. But the entire town just looks a little bit dilapidated. Our dinner is at the Rainforest Cafe, a restaurant chain with a unique indoor rainforest-themed decoration. The food was pretty normal and common with a slightly higher price (I guess because of the atmosphere). I think kids would really like dining in a place like this, but we have a pretty neutral feeling towards it. Day 2Being the only full day of our short trip, the focus for today is getting the best out of Niagara Falls, and we certainly did get a taste of it from all angles. There are a total of three falls in Niagara Falls. The Horseshoe Falls are the horseshoe-shaped falls (also known as the Canada Falls). It’s the most iconic and biggest falls, giving you a circular view when viewing on the Niagara River. There’s also the American Falls, located on the US side, just on the side of the State park, which is the most easy-to-access falls. The last and smallest one (about 1/6 of the width of the American Falls) is the Bridal Veil Falls located just past the American Falls (between Luna Island and Goat Island). It is the main view if you opt for the Cave of the Winds. Maid of The MistOur first stop is at the Maid of The Mist, a boat tour that takes you close to the foot of the Falls, our most anticipated activity. The touring season opens on Saturday, April 15, 2023, and runs until Sunday, November 5, 2023.More Info. You start by lining up outside the Observation tower and head down to the river level by elevator. The line wait only takes about 30 minutes (including getting the raincoat picked up and dressed), which is basically the duration of the boat tour. I enjoyed the boat ride very much; it is probably the best $30 I spent. Everyone headed to the upper deck, and you can move freely any time during the trip. We first arrived at the bottom of the American Falls and the Bridal Veil Falls for about a couple of minutes, where you can really feel the chilling wind driven by the falling water. Then the boat starts to head to one of the biggest waterfalls in the world: the Horseshoe Falls, one of the seven wonders in the world. The water splashing and the wind blowing get bigger and bigger as we got closer. The boat turns around at about 100 feet away from the Falls: it is the optimal distance as getting closer, the mist would obscure the view entirely. I must say it is almost like standing in a rainstorm, but with rain being replaced by splashing mist. It is very hard to capture the view from my phone camera with all the boat turning and the wet condition. But I get to enjoy everything from my eyes; this is one of those things that you have to experience in person. I’m completely stunned and moved by the raw power and sheer magnitude of the cascading river that is created by nature. Helicopter RideThe boat ride set an excellent mood for us in the morning, and we took a few pictures in the state park and bought a few souvenirs before heading to lunch. After a short nap, we went for the more expensive and private experience to enjoy the Niagara Falls from the best angle: from the sky. Rainbow Helicopter Tour runs just from the hotel regions, and the ticket is around $120 per person, but it’s a fixed $110 if you pay by cash, so that’s $10 plus tax (about $20) savings. There is a short line because only one helicopter is operating at a time on a first-come-first-serve basis. Each party waits around 10 minutes, 2 minutes to get onboard, and 8 minutes worth of the tour. The crew is quite friendly, offered us earplugs, and took a group photo before boarding. This is my first time riding a helicopter, and it is surprisingly fast how it takes off. My mind is completely occupied with looking at the views below, and I didn’t even have time to process sitting on a small vehicle hovering thousands of feet above the ground. Only when seeing from above did I understand the overall structure and scale of the Niagara Falls, and had a thorough glance at the Niagara river’s flow. It is a memorable but short experience. I would personally recommend it, but I admit the price is pretty steep. Goat IslandSince the helicopter ride was pretty short, we still had a few hours before the night got dark. We took an hour to walk along the Goat Island by crossing a bridge that crosses the American Falls. On the Goat island, you can observe the Falls fairly close-up, and from the surface level. When I look down as the water drops hundreds of feet below, I can’t help feeling a chill through my spine imagining what it would be like if I fell into the current. Anyways, Goat island is also a quite convenient location to visit and take pictures. Later, the Fashion Outlets of Niagara Falls USA also became a pretty good option to kill our time. Right after that, we headed to a nearby Thai food restaurant for dinner: the Mandalay Restaurant &amp; Bar. It serves one of the best pineapple fried rice and pork belly curry, and the price is also super cheap, so I highly recommend this restaurant. Light showAfter dinner, we had a stroll in the State Park again to enjoy the light show of the Niagara Falls that happens every evening. I know there are certain times in the year when there’s a holiday firework, but it is a rare occasion, and we didn’t plan for it. However, the light show is still pretty. Day 3We left Niagara Falls on the morning of Day 3, but we were planning to visit the Cave of the Winds. Unfortunately, our plan had to change due to more visitors coming during the weekends, and we didn’t want to go back home too late. I think we agreed we’ve seen plenty of the gorgeous Niagara Falls, but if we have more time, I would definitely pay it a visit, and also head to the Observation point for viewing Horseshoe Falls on the USA side. Other AttractionsIf you have more time here are some of the other attractions I think worth visiting: If you have more time, here are some other attractions worth visiting: Cave of the Winds: A natural cave behind Bridal Veil Falls at the Niagara Falls. You get to venture down wooden walkways and stand only feet away from the crashing water of the Bridal Veil Falls. A raincoat is necessary to avoid being completely soaked (even from the smallest of the three falls). Whirlpool Jet Boat Tours: A great option if you want to get some thrill, with dry or soaked options available, just a 10-minute drive from the Niagara Falls, downstream of the Niagara River. Niagara Zipper: Niagara Falls is not only about the water; try ziplining across the Erie Canal basin gorge, 85 feet above, at speeds up to 40 mph, crossing over the historic waters of the Erie Canal and back! Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"new york","slug":"united-states/new-york","permalink":"https://www.totrav.com/categories/united-states/new-york/"},{"name":"niagara","slug":"united-states/new-york/niagara","permalink":"https://www.totrav.com/categories/united-states/new-york/niagara/"}],"tags":[{"name":"weekend trip ideas","slug":"weekend-trip-ideas","permalink":"https://www.totrav.com/tags/weekend-trip-ideas/"}]},{"title":"Exploring Miami: 4 Days of Sunshine, Seafood, and Adventure","slug":"us-fl-miami","date":"2020-03-06T08:00:00.000Z","updated":"2024-01-02T00:09:57.012Z","comments":true,"path":"post/us-fl-miami/","link":"","permalink":"https://www.totrav.com/post/us-fl-miami/","excerpt":"Discover Miami's through this 4-day adventure. Explore the captivating Everglades, delectable stone crab and seafood, and enjoy thrilling airboat rides. Stroll along Miami's scenic beaches, shop at Bayside Market, and embark on an unforgettable culinary journey.","text":"A Miami dream Ratings Best Travel Date Cost Length &#11088;&#11088;&#11088; All year round $1200 4 days (3 nights) TLDR tips: Booking a flight to Fort Lauderdale (30 minutes away) is significantly cheaper ($100) than booking a direct flight to Miami ($400+) When ordering stone crab claws, opt for the medium size instead of large or jumbo size. medium size has much better value Joe’s stone crab: order a fried chicken along with Stone crab to save money. A half chicken costs only $9.9 Choose takeout, as the restaurant is often packed Avoid CVI.CHE 105. Time Stamps: Day 1 9:30 AM: Arrival at Fort Lauderdale airport 10:00 AM: West Lake Park 11:00 AM: Coast Side walk 12:00 PM: Lunch at GG’s Waterfront (2 hr) 3:00 PM: Hotel check in: 6080 Design Hotel by Eskape Collection Resting due to the early flight 7:00 PM: Dinner at The Tavern at Oceanside hotel Day 2 9:30 AM: Leave hotel 10:00 AM: Miami Beach walk (1 hr) 11:00 AM: City Center walk (2 hr) Lunch at City Center 2:00 PM: Hotel nap 4:00 PM: Miami South Beach walk (2 hr) 6:00 PM: Dinner on Lincoln Road 7:00 PM: Another dinner at Joe’s Stone Crab 8:00 PM: Return to hotel Day 3 8:30 AM: Leave hotel for Everglades Tour (2.5 hr) 11:00 AM: Arrive at Everglades Holiday Park Airboat Tours and Rides 11:30 AM: Airboat tour 12:00 PM: Gator show at Holiday Park 12:30 PM: Lunch at Holiday Park 1:00 PM: Return to hotel (2 hr) 3:00 PM: Hotel rest 6:00 PM: Dinner at Fifi’s on the Beach Seafood Restaurant 7:00 PM: Return to hotel Day 4 10:00 AM: Leave hotel 11:00 AM: Visit Bayside Marketplace and Bayfront Park 1:00 PM: Lunch at CVI.CHE 105 2:00 PM: Return ride to Fort Lauderdale airport (1 hr) Cost: Airplane tickets: $100 per person Ride-share (4 days): $90 per person Gator park guided tour (commute, admission, shows and airboat): $100 per person Food (7 meals): $350 per person Hotel (3 nights): $400 per person Total: $1100-$1200 _Views from today: Four years ago, we took a budget-friendly spring break trip right as COVID was starting.We found a great deal: the whole adventure cost us between $1,500 to $1,800, a real bargain considering today’s prices.Our timing was perfect since Florida hadn’t been hit hard by COVID yet. Day 1Here’s a money-saving tip: fly into Fort Lauderdale, not Miami. Booking a flight to Fort Lauderdale is significantly cheaper ($100) than booking a direct flight to Miami ($400+). Fort Lauderdale is only 20 miles away from downtown Miami. Landing in Fort Lauderdale to a warm 80°F was a nice break from the cold.We started with a leisurely walk at West Lake Park and then headed down to GG’s Waterfront. In Florida, you have to try stone crab.It’s a local specialty. Its flavor is incredibly natural and unprocessed/raw (probably why it’s unique to the state of Florida).Eating it by the sea was amazing. When ordering stone crab claws, opt for the medium size instead of large or jumbo size. A medium-sized claw comes in a set of six for about $40, whereas jumbo claws can set you back around $90 for just three pieces. The size difference between medium and jumbo is only about 30%, making the medium size a much better value. We took a ride-share service to Miami, which took about 40-50 minutes for a 12-mile journey (as there are no highway). The hotel was quite nice, and while there were numerous hotels in the region, dining options were limited unless you were willing to walk for about 15 minutes. This is why on our first night we settled for a nearby dining establishment serving simple dishes. Day 2Our second day began with a visit to the beach, marking my first time experiencing a Southern United States beach and witnessing the vast North Atlantic Ocean. The weather was just right: neither hot nor cold, perfect for a leisurely walk on the beach, although not warm enough to take a dip in the ocean (goodbye, swimsuit plans). Following a brief stop at the beach, we headed to Lincoln Road near the City Center district. The street exuded a unique and lively atmosphere, offering fantastic shopping and dining opportunities to soak in the local culture. Noon had arrived, and we decided on a Hispanic meal featuring seafood paella and a lobster feast. Afterward, we returned to the hotel for a well-deserved rest. In the afternoon, we explored another Miami beach, located in the south. It featured a boardwalk along the coastline similar to the one in Santa Monica, Los Angeles. During our visit, there was a winter party festival for the LGBTQ community, with many people congregating near the park. Later in a report it was said that led to 38 people contracting COVID-19 and resulted in two deaths. As the afternoon progressed, the wind picked up, and a few raindrops fell. Upon reaching the southernmost corner, we indulged in a lobster roll at a small shop. Within a five-minute walk, we discovered the famous Joe’s Stone Crab restaurant (arguably the most renowned Stone Crab establishment in Miami). Due to the crowd, we opted for a Stone crab takeout and their renowned fried chicken. To save money and still savor a satisfying meal, order the fried chicken with Stone crab. A half chicken costs only $9.9. Choose takeout, as the restaurant is often packed. Day 3Prior on visiting Miami, I’ve booked a one-day guided tour to the Everglades through TripAdvisor, as Florida is renowned for its unique swamplands. The tour was a round-trip from Miami downtown to The Everglades Holiday Park, and it turned out to be an excellent deal. For less than $100, we got the round-trip transportation, a thrilling half-hour airboat tour across the Everglades, a complimentary photo, and admission to the exciting gator show. The airboat tour was incredibly relaxed, allowing us to fully immerse ourselves in the mesmerizing Florida swamp. We encountered wild birds and, of course, some gators along the way. The gators, though not too active, were fascinating to observe as they remained still with their heads partially exposed. During the 30-45 minute tour, we spotted a couple of these incredible creatures. It’s worth mentioning that it can get quite chilly when the airboat hits full speed, approximately 40 mph, and the noise from the turbine can be deafening. So, don’t forget to bring a jacket! Immediately after the airboat tour, we were treated to a gator show featuring some daring and impressive performances. Our host was none other than Chris from the Gator Boys, a famous internet celebrity on TikTok, Instagram, and YouTube. Lunchtime arrived, and we headed to the restaurant and souvenir shop conveniently located on the premises. What did we decide to try? Fried gator meat! It had a unique taste, somewhat resembling dry fried chicken meat. In the evening, we dined at a charming restaurant called Fifi’s on the Beach Seafood. It turned out to be the culinary highlight of our Miami trip, offering delectable options like lobster and prawns, all of which tasted simply amazing! Day 4With just half a day left in Miami before our departure, our final destination was the lively Bayside Market and Bayside Park, where we were greeted by the sight of numerous sports cars cruising around. Bayside Market offered a delightful array of restaurants, sweet treats, and charming local shops, making it the perfect place for some last-minute gift shopping. Later, we ventured to a renowned award-winning Peruvian restaurant, CVI.CHE 105, particularly known for its ceviche. However, my review of the experience is rather disappointing. Not only were the dishes overpriced, but the quality felt rushed, as the meats appeared hastily cooked and blended together. And so, our memorable trip came to a close. The return ride-share to Fort Lauderdale Airport in the afternoon took a bit longer than expected, roughly around an hour, so be sure to plan accordingly. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"florida","slug":"united-states/florida","permalink":"https://www.totrav.com/categories/united-states/florida/"},{"name":"miami","slug":"united-states/florida/miami","permalink":"https://www.totrav.com/categories/united-states/florida/miami/"}],"tags":[{"name":"week-long trip ideas","slug":"week-long-trip-ideas","permalink":"https://www.totrav.com/tags/week-long-trip-ideas/"}]},{"title":"One Day at Pittsburgh: the Abandoned Industrial City","slug":"us-pa-pittsburgh","date":"2020-01-07T08:00:00.000Z","updated":"2023-12-03T01:46:51.506Z","comments":true,"path":"post/us-pa-pittsburgh/","link":"","permalink":"https://www.totrav.com/post/us-pa-pittsburgh/","excerpt":"Explore Pittsburgh's urban shifts from industrial decline to contemporary revival. Discover historic inclines like Duquesne, serene havens at Phipps Conservatory, and university campuses amidst the changing cityscape","text":"Experience American’s Urban Decay Ratings Best Travel Date Cost Length &#11088;&#128959;&#128959; Summer $80 1 day TLDR tips: may not be a fun family trip, but certainly memorable to experience the aftermath of the urban decay don’t travel during winter, it will be more depressing Time Stamps: (this can be crunched to one day) Day 1 12:30 PM: Lunch at Jade Grille 1:45 PM: Duquesne Incline 2:45 PM: Phipps Conservatory and Botanical Gardens 4:00 PM: Hotel Indigo Pittsburgh University Oakland, an IHG hotel 6:00 PM: Dinner at downtown: Central Oakland Day 2 10:00 AM: tour at Carnegie Mellon University 10:30 AM: tour at University of Pittsburgh 11:00 AM: St.Paul Cathedral Cost: Duquesne Incline ticket: $5 round trip Botanical gardens ticket: $22 (optional) Hotel stay: $50 per person per night Parking: $10 Food: $30 Total: $70-$120 Urban DecayDuring mid-20th century, US sees a decline in major industrial manufacturing city along the “Rust Belt” such as Detroit, Cleveland and Pittsburgh, this leads to a significang job losses and economy downturn. Many people move out of the urban areas, leaving poverty and crime remain. I get to see what it looks like first-hand in Pittburgh, just 2-hour away from where I lived: Columbus Ohio. Duquesne InclineOur first Pittsburgh stop was the Duquesne Incline, a century-old cargo and passenger incline. The parking lot is under construction with us being one of the few cars there, showcased the city’s sparse population. The $5 parking fee (equivalent to the round trip incline fare) is mandatory as street parking was non-existent. Boarding the cart was swift due to being the sole passengers. The uphill ride, ascending 400 feet at a 30-degree angle, took only a minute or two. Atop Mt. Washington, we sort of enjoyed a panoramic view of downtown Pittsburgh and its three rivers. Because despite being touted as one of America’s top 10 beautiful views, we only spent just 15 minutes there. The gloomy weather rendered the city somewhat bleak and lifeless and no reason for us to stay longer. Phipps Conservatory and Botanical GardensHowever, the Phipps Conservatory and Botanical Gardens provided a pleasant site. Amid Pittsburgh’s desolation, it felt like a hidden oasis, a lively core sneaking in a dead shell. We had a 90-minute stroll through the winter-greened Botanic Gardens that offered various flower and plant-themed rooms, some adorned for weddings and others for the holidays. The central room housed a miniature train track I think symbolizing Pittsburgh’s history? Parking was tight but free, contrasting the Duquesne Incline experience, the central pavement was specifically converted for parking to accommodate the amount of visitors. We arrived at our hotel: Hotel Indigo Pittsburgh University Oakland, an IHG hotel Later, it is located near the university district (the district is newly constructed, being very safe and quiet, other places are all too old and dangerous). The hotel fit our budget and preferences, being relatively new with friendly staff. However, the additional parking charge despite available space was a downside. The night arrives early in the winter time, and it was full dark when we head out in the downtown of the university district of Pittsburgh for food and boba tea. The street around Fifth Avenue is very quiet, but old and dirty making us feel unsafe, uncomfortable and unwelcome. There are just not a lot of people and not a lot of warmth surrounds us, so we quickly headed back. University TourExploring both Carnegie Mellon University and the University of Pittsburgh was another reason we came. The two universities are separated by the district near 5th Avenue, which was the place we had dinner last night. It was still on winter break, so not many students were on the campus for each university. We first toured Carnegie Mellon and then the University of Pittsburgh. We took about 30 minutes to walk around and take pictures of their famous landmarks. Since both universities live in a declining metropolitan city, it is not a surprise that the campus was not beautiful nor big. Our last stop was at the St. Paul Cathedral and Cathedral of Learning before running away from this aging city. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"pennsylvania","slug":"united-states/pennsylvania","permalink":"https://www.totrav.com/categories/united-states/pennsylvania/"},{"name":"pittsburgh","slug":"united-states/pennsylvania/pittsburgh","permalink":"https://www.totrav.com/categories/united-states/pennsylvania/pittsburgh/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]},{"title":"One Day at Michigan Lake 'Beach' and Lighthouse Outlets","slug":"us-in-michiganlake","date":"2019-05-14T07:00:00.000Z","updated":"2024-01-01T17:52:19.813Z","comments":true,"path":"post/us-in-michiganlake/","link":"","permalink":"https://www.totrav.com/post/us-in-michiganlake/","excerpt":"Explore Lake Michigan's charm, shop at Lighthouse Place Premium Outlets, and relish the natural beauty of Indiana Dunes State Park.","text":"The precious coastal treasure of the northeast America Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; May - September $25-$50 4-6 hours TLDR tips: Softer and cleaner sand in Dune state park compared to lighthouse Go to the Dune state park instead of the national park Time Stamps: 10:00 AM: Lighthouse Premium Outlets (2 hr) 12:00 PM: Shoreline Brewery &amp; Restaurant (1 hr) 1:00 PM: Michigan Pierhead Lighthouse (0.5 hr) 1:30 PM: Indiana Dunes State Park (1-2 hr) Hiking in State Park Swim or chilling time at State Park Cost: Lunch at Shoreline Brewery &amp; Restaurant: $25 per person Michigan Pierhead Lighthouse: Free Indiana Dunes State Park: $7 (in-state) per vehicle or. $12 (non-resident) per vehicle (Optional) Indiana Dunes National Park: $25 per vehicle Total: $32-$37 Lake Michigan, one of the five Great Lakes in the United States, is located right next to the metropolitan city of Chicago. The beautiful lakeside city of Michigan City is only a 1.5-hour drive away from Purdue University in West Lafayette, home of us the Boilermakers. For someone like me living in the east of the nation, it is the closest I can get for a costal beach experience, and for almost no costs at all! This is why throughout the years I spent living in the northern east, I’ve visited Michigan city three times. Indiana Dunes State ParkImportant: Don’t get confused with “Indiana Dunes National Park”, which is a different park and will get discussed at the very end of this blog. Let’s get straight to the lake, look at those beaches and water, there’s no distinction between the great lake and the actual ocean visually. This swim-able beach is located inside the Indiana Dunes State Park, spreading over 2000 acres. What’s more, the state park also offers over 16 miles of hiking trails. So, you can go for a short hike and then dive in and cool down at the gorgeous Michigan great lake. This is pretty unique feature that a lot of the actual coast don’t offer. The entry fee is very cheap, costing only $7 per vehicle for Indiana residents and $12 per vehicle for non-residents. Like all other state parks, there are certain days when the entry fees are free. Other StopsShoreline Brewery &amp; Restaurant If you need to grab a bite, I strongly recommend this place as I’ve visited them twice, and both experience were fantastic. They have excellent crafted beers and also their signature fish and chips. The restaurant is also right across the street to the premium outlets, and you get to see the lighthouse from the parking spot which is next to the lake coast. Michigan Pierhead Lighthouse This landmark stands proudly at the edge of Lake Michigan.The beach next to the lighthouse has harder sand compared to the state park. However, the advantage is that it offers a pretty spectacular view and, the best part, you can enjoy this stunning vista without spending a penny. Lighthouse Place Premium Outlets The Lighthouse Premium Outlets are also a great point of interest, with ample parking space and a wide variety of dining options. You will enjoy the open-air shopping experience whiling breathing in the fresh lakeside air. Indiana Dunes National Park (Optional) The Indian Dunes National Park is located on the both sides of the State Park, it is perfect for camping if you need plans for multiple days. The entry fee is $25 per vehicle for a 7-day pass. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"indiana","slug":"united-states/indiana","permalink":"https://www.totrav.com/categories/united-states/indiana/"},{"name":"michigan city","slug":"united-states/indiana/michigan-city","permalink":"https://www.totrav.com/categories/united-states/indiana/michigan-city/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]},{"title":"Spend Thanksgiving in Chicago","slug":"us-il-chicago","date":"2018-11-17T08:00:00.000Z","updated":"2023-11-19T18:06:02.931Z","comments":true,"path":"post/us-il-chicago/","link":"","permalink":"https://www.totrav.com/post/us-il-chicago/","excerpt":"Experience Chicago's charm during Thanksgiving break. Explore the Magnificent Mile's premium shopping, iconic Cloud Gate, and historic locations from Batman The Dark Knight. Enjoy skyline views at SkyDeck, visit Lincoln Park Zoo for ZooLights, and unwind in Lincoln Park.","text":"A Dream Come True Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; March - Novemeber $250 2-3 days TLDR tips: Visit the downtown Chicago is generally very safe, just don’t go south of Chicago late at night Don’t miss out the shooting locations for the movie Batman: the Dark Knight The Lights Festival Parade occurs on Saturday just before Thanksgiving every year (there’s also Thanksgiving Parade of course) 4:00 PM is perfect for SkyDeck tour, no need to purchase fast pass The Lincoln Park Zoo is worth visiting, admission is free Time Stamps: Day 1: 10:00 AM: Departure to Chicago 12:00 PM: Casual Lunch 1:00 PM: Arrive at FieldHouse Jones (Now The Chicago Hotel Collection River North) 3:00 PM: Downtown tour and walk Magnificent Mile Lights Festival 6:00 PM: The Berghoff Restaurant 7:00 PM: Cloud Gate 8:00 PM: Return to hotel Day 2: 10:00 AM: Leave hotel 10:30 AM: Magnificent Mile (2 hr) 1:00 PM: Lunch at Chinatown (2 hr) Subway back and forth to downtown 4:00 PM: SkyDeck Chicago 5:00 PM: Return to hotel Day 3: 10:00 AM: Leave hotel 10:30 AM: Lincoln Park Zoo (3.5 hr) 1:30 PM: Lincoln Park Conservatory 2:00 PM: Lunch at SaiMai Thai Restaurant Walk back to hotel 6:00 PM: Cocoro Restaurant 8:00 PM: Return to home Cost: FieldHouse Jones: $40 per person night (averaged) Parking: $10 per person per night (averaged) SkyDeck admission: $39 per person Lincoln Park Zoo Admission: Free Cloud Gate Admission: Free Transport: Rideshare: $15 per person (averaged) Metro: $10 per person (averaged) Food: Berghoff Restaurant: $30 per person Chinatown: $25 per person SaiMai Thai Restaurant $15 per person Cocoro Restaurant: $20 per person Total: $250-$300 It’s Thanksgiving break, and two of my friends and I decided to drive to the biggest metropolitan area nearby: Chicago (only 2.5 hours away). I was kind of skeptical about how the trip would turn out, as I’m very afraid of cold weather (Chicago this time of year is already hovering around zero degrees Celsius). However, the trip turned out to be surprisingly pleasant and bang for your buck. Day 1The drive was pretty smooth until we approached the downtown area. Fortunately, it was in the morning to noon, so the traffic was slow but still moving along. We arrived at our hotel, FieldHouse Jones (now The Chicago Hotel Collection River North). We parked just across the street from the hotel under a metro bridge. Parking was $30 a night with the hotel discount. Given the availability of public transportation and the difficulty of finding parking, we decided to leave the vehicle there for the entire trip. The hotel is a really nice establishment with a very unique American old-fashioned urban decor. The three of us shared a room, and with the surprisingly cheap average hotel price in a big city like Chicago and splitting the cost, I ended up only paying around $40 per night. Magnificent MileThe Magnificent Mile is within walking distance (15 minutes) from our hotel, one of the reasons we chose it. It’s the most popular and premium shopping district in Chicago, spanning over 13 blocks filled with luxury stores and skyscrapers, perfect for shopping. Today happened to be the Lights Festival Parade (which occurs on Saturday just before Thanksgiving every year), and people packed both sidewalks. It was a joy to squeeze through the crowds and merchants with a holiday season vibe. If you got tired watching the parade, you could easily head inside a random store to warm up (seriously, it was freezing outside). We didn’t spend too much time there because we had plenty of other sites to visit in the downtown region, plus we needed to grab a bite. Cloud Gate and Ice Stake RinkHeading to the far south end of the Magnificent Mile, just half a mile over the DuSable Bridge, we arrived at Millennium Park (also a metro stop). The park boasts the iconic and must-visit Cloud Gate. Cloud Gate is a modern, giant sculpture that looks like a bean. The sculpture has a reflective surface that captures the surrounding skyscrapers and your reflection. Just underneath the Cloud Gate platform is the McCormick Ice Skating Rink, and it was the perfect time for ice skating, costing just $20. Batman: The Dark Knight locationsAfter a 10-minute walk, we arrived at the famous German Berghoff Restaurant, established over 100 years ago. Chicago’s downtown was one of the shooting spots for Christopher Nolan’s Batman series, and the Berghoff Restaurant was featured as one of the movie spots for mobsters gathering in Batman: The Dark Knight. While in the downtown region, we visited other shooting locations as well. If you’re a Batman: The Dark Knight fan like us and want to visit all the movie locations in Chicago, this map is perfect for you. Day 2Our Day 2 began with a revisit to the Magnificent Mile because our rush visit last night wasn’t enough. Right after that, we took the metro to the south side of Chicago: Chinatown, where we had our lunch. SkyDeck ChicagoDo you want to know the perfect time to capture the view of Chicago from high above? It’s 4:00 PM in standard time (winter time) because within the hour, you get to see the sunset, experiencing both day and night views of Chicago. The wait to get up to the SkyDeck wasn’t too bad, about a 30-minute wait on weekends before a major holiday. I’d say it’s totally not worth spending twice the amount on admission to get the fast pass, as it may only save you 15 minutes since both lines eventually merge. There’s a transparent glass platform/floor in the SkyDeck where you can step onto and ask your friend to take a picture for a perfect unblocked view of you and Chicago. There’s a line for it, and each participation is timed. Day 3The Lincoln Park Zoo is a 35-acre zoo located in Lincoln Park, founded in 1868, making it one of the oldest zoos in the nation. The best thing, in my opinion, is that admission is completely free. I admit that this season might not be the best time to visit the zoo, as some of the outdoor animals are in hibernation, and it can be quite windy strolling inside the park. However, there are plenty of indoor animal exhibitions, and you won’t need to fight the crowds. The ZooLights event also starts around this time, and admission is less than $10, depending on which day you choose to visit. After visiting the zoo, Lincoln Park is a good place to stroll, located at the south end of the zoo. Taking a casual walk through the lakes, trees, and the Lincoln monument is quite relaxing. The Lincoln Park Conservatory botanic garden is located on the opposite side (north of the zoo). We had a bit to eat at a small but delicious Thai restaurant near the zoo and walked back to the hotel, experiencing the Old Town of Chicago with a 1.5-mile walk while sharing talks and laughs. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"illinois","slug":"united-states/illinois","permalink":"https://www.totrav.com/categories/united-states/illinois/"},{"name":"chicago","slug":"united-states/illinois/chicago","permalink":"https://www.totrav.com/categories/united-states/illinois/chicago/"}],"tags":[{"name":"weekend trip ideas","slug":"weekend-trip-ideas","permalink":"https://www.totrav.com/tags/weekend-trip-ideas/"}]},{"title":"Thanks Giving Break at Orlando's Universal Studio","slug":"us-fl-orlando","date":"2017-11-22T08:00:00.000Z","updated":"2024-01-02T03:55:56.068Z","comments":true,"path":"post/us-fl-orlando/","link":"","permalink":"https://www.totrav.com/post/us-fl-orlando/","excerpt":"In 3 Days, discover the thrills of top rides like the Incredible Hulk Coaster, immerse in the magic of the Harry Potter area, and enjoy classic park treats. Experience the fun, from crowd navigation with a fast pass to relaxing evening strolls.","text":"Universal Studio Florida: Check Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; All year round $1000 3-4 days TLDR tips: Islands of adventure has the most rides to take and Universal Studio Park has more universal studio seemed attractions and sites I recommend purchasing fast pass for islands of adventure I don’t recommend purchasing fast pass for universal studio park Plane tickets and hotels are pretty cheap even in holidays but the ticket prices are more expensive during holidays General park tips: Get in early when the park opens Eat light for breakfast and lunch Considering going on a Sunday (Weekend) or Wednesday (Week days), also crowd calendar for reference: https://www.isitpacked.com/crowd-calendars/ Cost: Ticket for Islands of Adventure: $120-$170 Ticket for Universal Studio Florida: $120-$170 Universal Express Pass: (Once per ride) $80 Unlimited version: $120 Parking &amp; Shuttle: Free Hotel: $50 per person per night Food: $120 Flight: $200 Total: $900-$1100 Day 1During Thanksgiving, we found surprisingly cheap flights to Orlando. It’s probably because big spots like Disneyland and Universal Studios can attract more visitors with lower flight fares. Our stay at the Best Western was a steal too, only averaging around $40 a night per person, and almost all hotels in the area offers a free shuttle to Universal Studios and other resorts, so that’s parking and transport fee saved as well. We were pumped to check out both parks at Universal Studios: the Islands of Adventure: your typical amusement park with many thrilling rides the Universal Studio Florida: leaning more towards movie themed attractions and interaction activities. The tickets start about $120 and goes up during weekends and holidays, and we since we expect a huge crowd during this time of the year, we opt in an extra $80 on a fast/express pass - totally worth it. Arriving in Orlando at night, we loved the warm 70s weather, a nice break from the freezing cold temperature back home in the Northeast. Day 2We got up early, grabbed a big breakfast at the hotel to keep us going all day. The shuttle from the hotel was handy - picked us up first and then went around picking up more folks. The whole ride to Universal Studios took about 30 minutes. Entering the security check entrance, and we already find the people piling up the gate has not yet opened, so you can imagine the quantity during peak. When we got there, people were already queuing up. I was pretty excited to join the stream of people as this is the first visit of Universal Studios Park for me. I’ve visited Disneyland when I was young and other second tier amusement park but not the famous one like this.. The weather was nice, just needing a shirt, and the sky was super clear. We started with the Incredible Hulk Coaster This is the most thrilling ride back in 2017 before the other two coaster was built (The Motorbike and the Jurassic World Coaster). First, we did the regular line, and it was so good we went again with our fast pass. After that, we hit Dr. Doom’s Fearfall and some water rides like Dudley Do-Right’s Ripsaw Falls. We got wet but dried off quickly in the warm weather. With our fast pass, we still waited around 20 to 40 minutes for each ride, but it was fun watching all the people and getting into the theme park vibe. We spent some time in the Harry Potter area too, going on rides like the Forbidden Journey. By afternoon, we were into the more chill part of the park, with rides that are a bit more laid-back. We didn’t really eat lunch because the breakfast kept us full. After passing 5 p.m, we finally got hungry and went for the classic turkey leg - it’s a big thing at these parks. We wandered around, looking at the shops and soaking up the atmosphere, but didn’t buy much. The park looked different at night with all the lights on. It was a great way to wrap up a day full of rides and fun. Day 3Day three was more laid-back. We skipped the fast pass since Universal Studios has more movie-themed attractions and fewer rides. As the season approaching Christmas, there are many Christmas decorations. The whole park is beautifully designed and filled with many Universal Studios IP from the movies and TV shows but less rides, this is where the movie magic came alive. We went to see the other Harry Potter location which is the dragon valley, although not being a huge fan, the brick wall, cobblestone streets, magical shops, and the imposing Gringotts Bank are impressive non-the-less. The most time was spent writing different type of indoor rides such as the transformers race through New York with Jimmy Fallon, fast and furious, and the revenge of the mummy; in my opinion the mummy ride was the best of all four. Though be warned, they can be a bit dizzying. That night, we ordered pizza delivery to the hotel from an ad we found in our room. It was pricey, so I wouldn’t recommend it. Day 4There was light rain in our last day, so we went to the Orlando premium outlets for shopping and for dining as well. I always like going to the outlets for purchasing my clothing, and the different locations of outlets usually offers different selections. The outlets today was dedicated to Black Friday shopping so the deals were irresistible. Lunch was a quick bite at a food court and surprisingly not a lot of crowd probably due to the weather. We left Orlando wishing we had time to explore more, like the Orlando Science Center or the airboat tours at Boggy Creek. The nightlife at Wall Street Plaza and Church Street, or the peaceful boat tours in Winter Park, would have been great too. Maybe next time! Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"florida","slug":"united-states/florida","permalink":"https://www.totrav.com/categories/united-states/florida/"},{"name":"orlando","slug":"united-states/florida/orlando","permalink":"https://www.totrav.com/categories/united-states/florida/orlando/"}],"tags":[{"name":"week-long trip ideas","slug":"week-long-trip-ideas","permalink":"https://www.totrav.com/tags/week-long-trip-ideas/"}]},{"title":"Take a Chill Day at University of Missouri (Mizzou)","slug":"us-mo-columbia","date":"2017-09-16T07:00:00.000Z","updated":"2023-11-05T02:48:18.338Z","comments":true,"path":"post/us-mo-columbia/","link":"","permalink":"https://www.totrav.com/post/us-mo-columbia/","excerpt":"Discover the heart of Missouri in Columbia, a college town with charm. We'll take you through campus vibes, hidden gems, and more. Unearth the essence of the heartland in just one visit.","text":"Small-town charm: your geta way for the weekend Ratings Best Travel Date Cost Length &#11088;&#128959;&#128959; All year round &lt;$25 3-4 hours TLDR tips: Visit inside the Mizzou Rec for SPA, only $12 (must have member accompany) The Big Burr Oak and the Capen park are the hidden gems Time Stamps: 12:00 PM: Lunch at Downtown (0.5 hr) 12:30 PM: Mizzou Tour (2 hr) (Optional) Mizzou Rec SPA (1 hr) 2:30 PM: Capen Park (1 hr) 3:30 PM: The Big Surr Oak (0.5 hr) Optional: Stephens Lake Park (0.5 hr) Columbia Mall (1 hr) Jefferson City (2.5 hr) Cost: Mizzou Tour: Free (Optional) Mizzou Rec entry: $12 per person Lunch: $10 per person The Big Surr Oak: Free (Optional) Missouri State Museum: Free Total: $10-22 Having spent over two years in Columbia - Missouri during my college days, I found it to be a serene and quintessential college town right in the heart of the United States. Situated right between two major Missouri cities, Kansas City and St. Louis, Columbia is a hidden gem that I recommend to anyone traveling through I-70; Stroll at MizzouThe centerpiece of our visit is the campus tour of the University of Missouri - Columbia (Mizzou). I advise setting aside at least 2 hours to explore the main part of the campus. Some must-see spots, in my opinion, include the iconic six columns (alongside Jesse Hall in the same plaza), the Memorial Union, Ellis Library, the Tiger fountain and the Student Center (with the Rec Center conveniently just across the street). For your ease, I’ve outlined an optimal walking route to cover all these interesting points efficiently as I’ve been tour guiding friends and families multiple times. (Route start at Lee Hills Hall) Exploring Campus BuildingsMany of the campus buildings are open to the public. Don’t miss out on visiting the Engineering Building (which was newly built), Jesse Hall, Ellis Library, Memorial Union, and the Student Center. The campus bookstore is also in the Student Center if you wish to purchase Mizzou souvenirs. Mizzou Rec’s Guest ServicesIf you happen to know someone studying in Mizzou, I highly recommend visiting the Mizzou Rec for a reasonable fee of $12 (including tax). In addition to the gym facilities, they offer a spa for some relaxation. Did I mention, it was once voted as top 3 best recreational center in the nation. Learn more here: Mizzou Rec Guest Services Downtown DelightsColumbia’s downtown area offers a range of delightful options. I often go to the boba shop: Bubblecup Tea Zone, Thai restaurants (Thai Express and Bangkok Gardens are my top picks), and much more to satisfy any taste buds for lunch or dinner after the campus tour The Big Burr OakColumbia’s hidden gem, in my opinion, is the Big burr oak tree. It’s definitely worth a short 10-mile trip, taking less than 20 minutes to drive. The journey is peaceful and the destination is Instagram-worthy shot of a huge Oak tree with the perfect tree crown. Other StopsStephens Lake Park:If you’re looking for a place to unwind after your tour or road trip, I recommend Stephens Lake Park. Although not vast, it features a charming small lake with walking bridges (often bustling with people fishing). It’s a picnic-friendly spot and even welcomes your furry friends. Capen Park:Capen Park is perfect for you if you’d like to get some outdoor trail walking going where you can experience some small elevation with beautiful cliffs. It’s only 5 minutes drive away from Mizzou Campus. The Grindstone Creek (which you’ll be able to overlook) is also accessible on foot. Columbia Mall:For some generic retail stores beyond the downtown area, a visit to the Columbia Mall is a good choice. Jefferson City:The Capital of Missouri, Jefferson City is about a 50 minutes drive from Columbia towards the south, so it’s not in the same direction between Kansas City and St Louis.There’s a pretty good Sushi place called love sushi, they are in good value (the sexy lady and sexy guy are brought with fire lit). Other than the State Capitol Hall and the Missouri State Museum there’s not much to visit. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"},{"name":"columbia","slug":"united-states/missouri/columbia","permalink":"https://www.totrav.com/categories/united-states/missouri/columbia/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]}],"categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"ohio","slug":"united-states/ohio","permalink":"https://www.totrav.com/categories/united-states/ohio/"},{"name":"cedar point","slug":"united-states/ohio/cedar-point","permalink":"https://www.totrav.com/categories/united-states/ohio/cedar-point/"},{"name":"california","slug":"united-states/california","permalink":"https://www.totrav.com/categories/united-states/california/"},{"name":"san diego","slug":"united-states/california/san-diego","permalink":"https://www.totrav.com/categories/united-states/california/san-diego/"},{"name":"cleveland","slug":"united-states/ohio/cleveland","permalink":"https://www.totrav.com/categories/united-states/ohio/cleveland/"},{"name":"dc","slug":"united-states/dc","permalink":"https://www.totrav.com/categories/united-states/dc/"},{"name":"put-in-bay","slug":"united-states/ohio/put-in-bay","permalink":"https://www.totrav.com/categories/united-states/ohio/put-in-bay/"},{"name":"new york","slug":"united-states/new-york","permalink":"https://www.totrav.com/categories/united-states/new-york/"},{"name":"niagara","slug":"united-states/new-york/niagara","permalink":"https://www.totrav.com/categories/united-states/new-york/niagara/"},{"name":"florida","slug":"united-states/florida","permalink":"https://www.totrav.com/categories/united-states/florida/"},{"name":"miami","slug":"united-states/florida/miami","permalink":"https://www.totrav.com/categories/united-states/florida/miami/"},{"name":"pennsylvania","slug":"united-states/pennsylvania","permalink":"https://www.totrav.com/categories/united-states/pennsylvania/"},{"name":"pittsburgh","slug":"united-states/pennsylvania/pittsburgh","permalink":"https://www.totrav.com/categories/united-states/pennsylvania/pittsburgh/"},{"name":"indiana","slug":"united-states/indiana","permalink":"https://www.totrav.com/categories/united-states/indiana/"},{"name":"michigan city","slug":"united-states/indiana/michigan-city","permalink":"https://www.totrav.com/categories/united-states/indiana/michigan-city/"},{"name":"illinois","slug":"united-states/illinois","permalink":"https://www.totrav.com/categories/united-states/illinois/"},{"name":"chicago","slug":"united-states/illinois/chicago","permalink":"https://www.totrav.com/categories/united-states/illinois/chicago/"},{"name":"orlando","slug":"united-states/florida/orlando","permalink":"https://www.totrav.com/categories/united-states/florida/orlando/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"},{"name":"columbia","slug":"united-states/missouri/columbia","permalink":"https://www.totrav.com/categories/united-states/missouri/columbia/"}],"tags":[{"name":"review","slug":"review","permalink":"https://www.totrav.com/tags/review/"},{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"},{"name":"weekend trip ideas","slug":"weekend-trip-ideas","permalink":"https://www.totrav.com/tags/weekend-trip-ideas/"},{"name":"week-long trip ideas","slug":"week-long-trip-ideas","permalink":"https://www.totrav.com/tags/week-long-trip-ideas/"}]}