{"meta":{"title":"to trav","subtitle":"","description":"","author":"Sarah. L","url":"https://www.totrav.com","root":"/"},"pages":[{"title":"About Me","date":"2023-10-27T18:17:15.940Z","updated":"2023-10-27T18:17:15.940Z","comments":false,"path":"about/index.html","permalink":"https://www.totrav.com/about/index.html","excerpt":"","text":"I saved a life, my own. Am I a hero? I really can’t say, but yes My name is Sarah, just 24 years old, and I’ve got some incredible adventures I’d like to share with you. A little more about me: I’ve lived in six different states in the United States and traveled to over 30 states. The world is my playground, and I like to capture all my stories with my cameras. Come, join me as we continue to explore, wonder, and celebrating the beauty of our world together. Let’s embark on this incredible journey as we wander, laugh, and create unforgettable stories all around the globe."}],"posts":[{"title":"One Day at Michigan Lake 'Beach' and Lighthouse Outlets","slug":"us-in-michiganlake","date":"2019-05-14T07:00:00.000Z","updated":"2023-10-29T06:22:16.838Z","comments":true,"path":"post/us-in-michiganlake/","link":"","permalink":"https://www.totrav.com/post/us-in-michiganlake/","excerpt":"Explore Lake Michigan's charm, shop at Lighthouse Place Premium Outlets, and relish the natural beauty of Indiana Dunes State Park.","text":"The precious coastal treasure of the northeast America Ratings Best Travel Date Cost Length &#11088;&#11088;&#128959; May - September &lt;$25 4-6 hours Time Stamps: 10:00 AM: Lighthouse Premium Outlets (2 hr) 12:00 PM: Shoreline Brewery &amp; Restaurant (1 hr) 1:00 PM: Michigan Pierhead Lighthouse (0.5 hr) 1:30 PM: Indiana Dunes State Park (1-2 hr) Hiking in State Park Swim or chilling time at State Park Cost: Lunch at Shoreline Brewery &amp; Restaurant: $25 per person Michigan Pierhead Lighthouse: Free Indiana Dunes State Park: $7 (in-state) per vehicle or. $12 (non-resident) per vehicle Total: $ Lake Michigan, one of the five Great Lakes in the United States, is located right next to the metropolitan city of Chicago. The beautiful lakeside city of Michigan City is only a 1.5-hour drive away from Purdue University in West Lafayette, home of the Boilermakers. For someone like me living in the middle east of the nation, it is the closest I can get for a costal ocean and beach experience, and for almost no costs! Indiana Dunes State ParkLet’s get straight to the point, look at those beaches and water, there’s no distinction between this great lake and the actual ocean visually. The swimming beach is located inside the Indiana Dunes State Park, spreading over 2000 acres. What’s more, the state park also offers over 16 miles of hiking trails. So, you can go for a short hike and then dive in and cool down at the gorgeous Michigan great lake. The entry fee is only $7 per vehicle for Indiana residents and $12 per vehicle for non-residents. Like all other state parks, there are certain days when the entry fees are free. Indiana Dunes National ParkThe Indian Dunes National Park is located on the both sides of the State Park, it is perfect for camping if you need plans for multiple days. The entry fee is $25 per vehicle for a 7-day pass. Other StopsShoreline Brewery &amp; Restaurant If you need to grab a bite, I strongly recommend this place as I’ve happened to visit them twice, and both experience were fantastic. They have excellent crafted beers and also amazing fish and chips. The restaurant is also super close to the premium outlets and also the lighthouse next to the lake coast. Michigan Pierhead Lighthouse This landmark stands proudly at the edge of Lake Michigan.The beach next to the lighthouse has hard sand compared to the state park. However, the advantage is that it offers a pretty spectacular view and, the best part, you can enjoy this stunning vista without spending a dime. Lighthouse Place Premium Outlets The Lighthouse Premium Outlets are also a point of interest, with ample parking space and a wide variety of dining options. As you shop, you can enjoy the open-air experience and breathe in the fresh lakeside air. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"indiana","slug":"united-states/indiana","permalink":"https://www.totrav.com/categories/united-states/indiana/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]},{"title":"Take a Chill Day at University of Missouri (Mizzou)","slug":"us-mo-columbia","date":"2017-09-16T07:00:00.000Z","updated":"2023-10-29T04:01:07.178Z","comments":true,"path":"post/us-mo-columbia/","link":"","permalink":"https://www.totrav.com/post/us-mo-columbia/","excerpt":"Discover the heart of Missouri in Columbia, a college town with charm. We'll take you through campus vibes, hidden gems, and more. Unearth the essence of the heartland in just one visit.","text":"Small-town charm: your geta way for the weekend Ratings Best Travel Date Cost Length &#11088;&#128959;&#128959; All year round &lt;$25 3-4 hours Time Stamps: 12:00 PM: Lunch at Downtown (0.5 hr) 12:30 PM: Mizzou Tour (2 hr) (Optional) Mizzou Rec SPA (1 hr) 2:30 PM: Capen Park (1 hr) 3:30 PM: The Big Surr Oak (0.5 hr) Optional: Stephens Lake Park (0.5 hr) Columbia Mall (1 hr) Jefferson City (2.5 hr) Cost: Mizzou Tour: Free (Optional) Mizzou Rec entry: $12 per person Lunch: $10 per person The Big Surr Oak: Free (Optional) Missouri State Museum: Free Total: $10-22 Having spent over two years in Columbia - Missouri during my college days, I found it to be a serene and quintessential college town right in the heart of the United States. Situated right between two major Missouri cities, Kansas City and St. Louis, Columbia is a hidden gem that I recommend to anyone traveling through I-70; Stroll at MizzouThe centerpiece of our visit is the campus tour of the University of Missouri - Columbia (Mizzou). I advise setting aside at least 2 hours to explore the main part of the campus.Some must-see spots, in my opinion, include the iconic six columns (alongside Jesse Hall in the same plaza), the Memorial Union, Ellis Library, the Tiger fountain and the Student Center (with the Rec Center conveniently just across the street).For your ease, I’ve outlined an optimal walking route to cover all these interesting points efficiently as I’ve been tour guiding friends and families multiple times. (Route start at Lee Hills Hall) Exploring Campus BuildingsMany of the campus buildings are open to the public. Don’t miss out on visiting the Engineering Building (which was newly built), Jesse Hall, Ellis Library, Memorial Union, and the Student Center. The campus bookstore is also in the Student Center if you wish to purchase Mizzou souvenirs. Mizzou Rec’s Guest ServicesIf you happen to know someone studying in Mizzou, I highly recommend visiting the Mizzou Rec for a reasonable fee of $12 (including tax). In addition to the gym facilities, they offer a spa for some relaxation. Did I mention, it was once voted as top 3 best recreational center in the nation. Learn more here: Mizzou Rec Guest Services Downtown DelightsColumbia’s downtown area offers a range of delightful options. I often go to the boba shop: Bubblecup Tea Zone, Thai restaurants (Thai Express and Bangkok Gardens are my top picks), and much more to satisfy any taste buds for lunch or dinner after the campus tour The Big Burr OakColumbia’s hidden gem, in my opinion, is the Big burr oak tree. It’s definitely worth a short 10-mile trip, taking less than 20 minutes to drive. The journey is peaceful and the destination is Instagram-worthy shot of a huge Oak tree with the perfect tree crown. Other StopsStephens Lake Park:If you’re looking for a place to unwind after your tour or road trip, I recommend Stephens Lake Park. Although not vast, it features a charming small lake with walking bridges (often bustling with people fishing). It’s a picnic-friendly spot and even welcomes your furry friends. Capen Park:Capen Park is perfect for you if you’d like to get some outdoor trail walking going where you can experience some small elevation with beautiful cliffs. It’s only 5 minutes drive away from Mizzou Campus. The Grindstone Creek (which you’ll be able to overlook) is also accessible on foot. Columbia Mall:For some generic retail stores beyond the downtown area, a visit to the Columbia Mall is a good choice. Jefferson City:The Capital of Missouri, Jefferson City is about a 50 minutes drive from Columbia towards the south, so it’s not in the same direction between Kansas City and St Louis.There’s a pretty good Sushi place called love sushi, they are in good value (the sexy lady and sexy guy are brought with fire lit). Other than the State Capitol Hall and the Missouri State Museum there’s not much to visit. Your support keeps our adventures alive. Join us in exploring!","categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]}],"categories":[{"name":"united states","slug":"united-states","permalink":"https://www.totrav.com/categories/united-states/"},{"name":"indiana","slug":"united-states/indiana","permalink":"https://www.totrav.com/categories/united-states/indiana/"},{"name":"missouri","slug":"united-states/missouri","permalink":"https://www.totrav.com/categories/united-states/missouri/"}],"tags":[{"name":"day trip ideas","slug":"day-trip-ideas","permalink":"https://www.totrav.com/tags/day-trip-ideas/"}]}